app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Feeney"], ["email", "keith.feeney@student.ncirl.ie"], ["phone", "0860375386"], ["created_at", "2019-03-18 15:57:49.862187"], ["updated_at", "2019-03-18 15:57:49.862187"]]